---
kind: method
id: M:Autodesk.Revit.DB.RelinquishOptions.#ctor(System.Boolean)
source: html/43eab4bb-c555-07f7-11b1-e029c009299a.htm
---
# Autodesk.Revit.DB.RelinquishOptions.#ctor Method

Constructs a new instance of RelinquishOptions.

## Syntax (C#)
```csharp
public RelinquishOptions(
	bool relinquishEverything
)
```

## Parameters
- **relinquishEverything** (`System.Boolean`) - The value to apply to all of the members.